----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 128, 128]             864
       BatchNorm2d-2         [-1, 32, 128, 128]              64
              SiLU-3         [-1, 32, 128, 128]               0
            Conv2d-4         [-1, 64, 128, 128]          18,432
       BatchNorm2d-5         [-1, 64, 128, 128]             128
              SiLU-6         [-1, 64, 128, 128]               0
            Conv2d-7         [-1, 64, 128, 128]          36,864
       BatchNorm2d-8         [-1, 64, 128, 128]             128
              SiLU-9         [-1, 64, 128, 128]               0
           Conv2d-10         [-1, 64, 128, 128]          36,864
      BatchNorm2d-11         [-1, 64, 128, 128]             128
AdaptiveAvgPool2d-12             [-1, 64, 1, 1]               0
           Conv2d-13              [-1, 4, 1, 1]             256
             SiLU-14              [-1, 4, 1, 1]               0
           Conv2d-15             [-1, 64, 1, 1]             256
AdaptiveMaxPool2d-16             [-1, 64, 1, 1]               0
           Conv2d-17              [-1, 4, 1, 1]             256
             SiLU-18              [-1, 4, 1, 1]               0
           Conv2d-19             [-1, 64, 1, 1]             256
          Sigmoid-20             [-1, 64, 1, 1]               0
 ChannelAttention-21             [-1, 64, 1, 1]               0
           Conv2d-22          [-1, 1, 128, 128]              98
          Sigmoid-23          [-1, 1, 128, 128]               0
 SpatialAttention-24          [-1, 1, 128, 128]               0
             CBAM-25         [-1, 64, 128, 128]               0
  StochasticDepth-26         [-1, 64, 128, 128]               0
             SiLU-27         [-1, 64, 128, 128]               0
SOTA_ResidualBlock-28         [-1, 64, 128, 128]               0
           Conv2d-29         [-1, 64, 128, 128]          36,864
      BatchNorm2d-30         [-1, 64, 128, 128]             128
             SiLU-31         [-1, 64, 128, 128]               0
           Conv2d-32         [-1, 64, 128, 128]          36,864
      BatchNorm2d-33         [-1, 64, 128, 128]             128
AdaptiveAvgPool2d-34             [-1, 64, 1, 1]               0
           Conv2d-35              [-1, 4, 1, 1]             256
             SiLU-36              [-1, 4, 1, 1]               0
           Conv2d-37             [-1, 64, 1, 1]             256
AdaptiveMaxPool2d-38             [-1, 64, 1, 1]               0
           Conv2d-39              [-1, 4, 1, 1]             256
             SiLU-40              [-1, 4, 1, 1]               0
           Conv2d-41             [-1, 64, 1, 1]             256
          Sigmoid-42             [-1, 64, 1, 1]               0
 ChannelAttention-43             [-1, 64, 1, 1]               0
           Conv2d-44          [-1, 1, 128, 128]              98
          Sigmoid-45          [-1, 1, 128, 128]               0
 SpatialAttention-46          [-1, 1, 128, 128]               0
             CBAM-47         [-1, 64, 128, 128]               0
  StochasticDepth-48         [-1, 64, 128, 128]               0
             SiLU-49         [-1, 64, 128, 128]               0
SOTA_ResidualBlock-50         [-1, 64, 128, 128]               0
           Conv2d-51          [-1, 128, 64, 64]           8,192
      BatchNorm2d-52          [-1, 128, 64, 64]             256
           Conv2d-53          [-1, 128, 64, 64]          73,728
      BatchNorm2d-54          [-1, 128, 64, 64]             256
             SiLU-55          [-1, 128, 64, 64]               0
           Conv2d-56          [-1, 128, 64, 64]         147,456
      BatchNorm2d-57          [-1, 128, 64, 64]             256
AdaptiveAvgPool2d-58            [-1, 128, 1, 1]               0
           Conv2d-59              [-1, 8, 1, 1]           1,024
             SiLU-60              [-1, 8, 1, 1]               0
           Conv2d-61            [-1, 128, 1, 1]           1,024
AdaptiveMaxPool2d-62            [-1, 128, 1, 1]               0
           Conv2d-63              [-1, 8, 1, 1]           1,024
             SiLU-64              [-1, 8, 1, 1]               0
           Conv2d-65            [-1, 128, 1, 1]           1,024
          Sigmoid-66            [-1, 128, 1, 1]               0
 ChannelAttention-67            [-1, 128, 1, 1]               0
           Conv2d-68            [-1, 1, 64, 64]              98
          Sigmoid-69            [-1, 1, 64, 64]               0
 SpatialAttention-70            [-1, 1, 64, 64]               0
             CBAM-71          [-1, 128, 64, 64]               0
  StochasticDepth-72          [-1, 128, 64, 64]               0
             SiLU-73          [-1, 128, 64, 64]               0
SOTA_ResidualBlock-74          [-1, 128, 64, 64]               0
           Conv2d-75          [-1, 128, 64, 64]         147,456
      BatchNorm2d-76          [-1, 128, 64, 64]             256
             SiLU-77          [-1, 128, 64, 64]               0
           Conv2d-78          [-1, 128, 64, 64]         147,456
      BatchNorm2d-79          [-1, 128, 64, 64]             256
AdaptiveAvgPool2d-80            [-1, 128, 1, 1]               0
           Conv2d-81              [-1, 8, 1, 1]           1,024
             SiLU-82              [-1, 8, 1, 1]               0
           Conv2d-83            [-1, 128, 1, 1]           1,024
AdaptiveMaxPool2d-84            [-1, 128, 1, 1]               0
           Conv2d-85              [-1, 8, 1, 1]           1,024
             SiLU-86              [-1, 8, 1, 1]               0
           Conv2d-87            [-1, 128, 1, 1]           1,024
          Sigmoid-88            [-1, 128, 1, 1]               0
 ChannelAttention-89            [-1, 128, 1, 1]               0
           Conv2d-90            [-1, 1, 64, 64]              98
          Sigmoid-91            [-1, 1, 64, 64]               0
 SpatialAttention-92            [-1, 1, 64, 64]               0
             CBAM-93          [-1, 128, 64, 64]               0
  StochasticDepth-94          [-1, 128, 64, 64]               0
             SiLU-95          [-1, 128, 64, 64]               0
SOTA_ResidualBlock-96          [-1, 128, 64, 64]               0
           Conv2d-97          [-1, 256, 32, 32]          32,768
      BatchNorm2d-98          [-1, 256, 32, 32]             512
           Conv2d-99          [-1, 256, 32, 32]         294,912
     BatchNorm2d-100          [-1, 256, 32, 32]             512
            SiLU-101          [-1, 256, 32, 32]               0
          Conv2d-102          [-1, 256, 32, 32]         589,824
     BatchNorm2d-103          [-1, 256, 32, 32]             512
AdaptiveAvgPool2d-104            [-1, 256, 1, 1]               0
          Conv2d-105             [-1, 16, 1, 1]           4,096
            SiLU-106             [-1, 16, 1, 1]               0
          Conv2d-107            [-1, 256, 1, 1]           4,096
AdaptiveMaxPool2d-108            [-1, 256, 1, 1]               0
          Conv2d-109             [-1, 16, 1, 1]           4,096
            SiLU-110             [-1, 16, 1, 1]               0
          Conv2d-111            [-1, 256, 1, 1]           4,096
         Sigmoid-112            [-1, 256, 1, 1]               0
ChannelAttention-113            [-1, 256, 1, 1]               0
          Conv2d-114            [-1, 1, 32, 32]              98
         Sigmoid-115            [-1, 1, 32, 32]               0
SpatialAttention-116            [-1, 1, 32, 32]               0
            CBAM-117          [-1, 256, 32, 32]               0
 StochasticDepth-118          [-1, 256, 32, 32]               0
            SiLU-119          [-1, 256, 32, 32]               0
SOTA_ResidualBlock-120          [-1, 256, 32, 32]               0
          Conv2d-121          [-1, 256, 32, 32]         589,824
     BatchNorm2d-122          [-1, 256, 32, 32]             512
            SiLU-123          [-1, 256, 32, 32]               0
          Conv2d-124          [-1, 256, 32, 32]         589,824
     BatchNorm2d-125          [-1, 256, 32, 32]             512
AdaptiveAvgPool2d-126            [-1, 256, 1, 1]               0
          Conv2d-127             [-1, 16, 1, 1]           4,096
            SiLU-128             [-1, 16, 1, 1]               0
          Conv2d-129            [-1, 256, 1, 1]           4,096
AdaptiveMaxPool2d-130            [-1, 256, 1, 1]               0
          Conv2d-131             [-1, 16, 1, 1]           4,096
            SiLU-132             [-1, 16, 1, 1]               0
          Conv2d-133            [-1, 256, 1, 1]           4,096
         Sigmoid-134            [-1, 256, 1, 1]               0
ChannelAttention-135            [-1, 256, 1, 1]               0
          Conv2d-136            [-1, 1, 32, 32]              98
         Sigmoid-137            [-1, 1, 32, 32]               0
SpatialAttention-138            [-1, 1, 32, 32]               0
            CBAM-139          [-1, 256, 32, 32]               0
 StochasticDepth-140          [-1, 256, 32, 32]               0
            SiLU-141          [-1, 256, 32, 32]               0
SOTA_ResidualBlock-142          [-1, 256, 32, 32]               0
          Conv2d-143          [-1, 512, 16, 16]         131,072
     BatchNorm2d-144          [-1, 512, 16, 16]           1,024
          Conv2d-145          [-1, 512, 16, 16]       1,179,648
     BatchNorm2d-146          [-1, 512, 16, 16]           1,024
            SiLU-147          [-1, 512, 16, 16]               0
          Conv2d-148          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-149          [-1, 512, 16, 16]           1,024
AdaptiveAvgPool2d-150            [-1, 512, 1, 1]               0
          Conv2d-151             [-1, 32, 1, 1]          16,384
            SiLU-152             [-1, 32, 1, 1]               0
          Conv2d-153            [-1, 512, 1, 1]          16,384
AdaptiveMaxPool2d-154            [-1, 512, 1, 1]               0
          Conv2d-155             [-1, 32, 1, 1]          16,384
            SiLU-156             [-1, 32, 1, 1]               0
          Conv2d-157            [-1, 512, 1, 1]          16,384
         Sigmoid-158            [-1, 512, 1, 1]               0
ChannelAttention-159            [-1, 512, 1, 1]               0
          Conv2d-160            [-1, 1, 16, 16]              98
         Sigmoid-161            [-1, 1, 16, 16]               0
SpatialAttention-162            [-1, 1, 16, 16]               0
            CBAM-163          [-1, 512, 16, 16]               0
 StochasticDepth-164          [-1, 512, 16, 16]               0
            SiLU-165          [-1, 512, 16, 16]               0
SOTA_ResidualBlock-166          [-1, 512, 16, 16]               0
          Conv2d-167          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-168          [-1, 512, 16, 16]           1,024
            SiLU-169          [-1, 512, 16, 16]               0
          Conv2d-170          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-171          [-1, 512, 16, 16]           1,024
AdaptiveAvgPool2d-172            [-1, 512, 1, 1]               0
          Conv2d-173             [-1, 32, 1, 1]          16,384
            SiLU-174             [-1, 32, 1, 1]               0
          Conv2d-175            [-1, 512, 1, 1]          16,384
AdaptiveMaxPool2d-176            [-1, 512, 1, 1]               0
          Conv2d-177             [-1, 32, 1, 1]          16,384
            SiLU-178             [-1, 32, 1, 1]               0
          Conv2d-179            [-1, 512, 1, 1]          16,384
         Sigmoid-180            [-1, 512, 1, 1]               0
ChannelAttention-181            [-1, 512, 1, 1]               0
          Conv2d-182            [-1, 1, 16, 16]              98
         Sigmoid-183            [-1, 1, 16, 16]               0
SpatialAttention-184            [-1, 1, 16, 16]               0
            CBAM-185          [-1, 512, 16, 16]               0
 StochasticDepth-186          [-1, 512, 16, 16]               0
            SiLU-187          [-1, 512, 16, 16]               0
SOTA_ResidualBlock-188          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-189            [-1, 512, 1, 1]               0
         Flatten-190                  [-1, 512]               0
          Linear-191                 [-1, 1024]         525,312
     BatchNorm1d-192                 [-1, 1024]           2,048
            SiLU-193                 [-1, 1024]               0
         Dropout-194                 [-1, 1024]               0
          Linear-195                  [-1, 115]         117,875
  SOTA_CustomCNN-196                  [-1, 115]               0
================================================================
Total params: 12,006,563
Trainable params: 12,006,563
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 321.13
Params size (MB): 45.80
Estimated Total Size (MB): 367.68
----------------------------------------------------------------
